KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_РезультатИспытаний/КАНАТ_РезультатИспытаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_РезультатИспытаний</name>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НТДПродукции</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Структура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаправочныеПараметры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПартияГотовойПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлажностьФакт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидГотовойПродукцииИспытания</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаИМетодикаИспытаний</name>
    <type>
      <types>CatalogRef.КАНАТ_ПрограммаИМетодикаИспытаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСертификатаКачества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовленияГотовойПродукции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерБухты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСырье</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСырье</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСырье</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СырьеДляПечатнойФормы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаСырья</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НТДСырья</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияСырья</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПримечаниеПоСырью</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатИспытаний</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимоеОтклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьВПФ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/ЭтапПроизводства2_2/ЭтапПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="03503ac6-a4b9-4d70-b0ef-949dac7b8de4">
  <name>ЭтапПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатуры</registerRecords>
  <attributes>
    <name>КАНАТ_КомментарийКЗаказу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Сертификат</name>
    <type>
      <types>CatalogRef.КАНАТ_Сертификаты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="49fb8c7a-a984-433d-9013-98b3f1808eba">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0662487e-07e7-4fe3-b008-ffb293a9f154">
    <name>Спецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="38ea66f4-5bfa-48f1-8431-a99d27fcf31d">
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="dc035f49-1f37-4bf6-a369-751f132442a2">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>CatalogRef.КАНАТ_Сертификаты</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="20aa6e93-6a18-4526-830f-8d45d3e04bb6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5d7b896b-c4b4-4604-9f9b-3b0fcf1196e3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42da4e01-6f2b-447f-a8ce-82c02d461afd">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="691cd7ff-4cd5-4d21-a6a6-32338ca8eb43">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="3a4b1c3c-2a58-45b8-bea3-df1e63deaecc">
    <name>РасходМатериаловИРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f770e39d-256e-4caa-a806-c8d8fbdc962b">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4bfa3470-ec68-4384-ab44-61dc34f81542">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c2a5e8ce-e0dd-4c5e-bacb-a38121ee5440">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ca22f78a-e6c7-4d0a-abdf-dafcd0e7e8ca">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_НТДНоменклатуры</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0e7e0970-627b-458f-8d96-ef13c523d2b8">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КАНАТКач_ВидДляКонтроляКачества</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1b521724-19bd-43e6-b544-b67dc4ba22b9">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ТекстДублиАртикулов</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_НеГенерироватьАртикул</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="97ef8ff9-68db-45ee-91be-54bfb600b3a1">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ОБъектБылИзменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_ПоказателиНТД</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Размерность</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_РезультатИспытаний/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПроизводствоБезЗаказа") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ПроизводствоБезЗаказа.Подразделение КАК Цех,
		|	НоменклатураПродукция.Ссылка КАК Продукция,
		|	НоменклатураПродукция.КАНАТ_НТДНоменклатуры КАК НТДПродукции,
		|	ВЫБОР
		|	КОГДА ТИПЗНАЧЕНИЯ(Назначения.Заказ) = ТИП(Документ.ЗаказКлиента) ТОГДА Назначения.Заказ
		|	ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	КОНЕЦ КАК ЗаказКлиента,
		|	НоменклатураСырье.Ссылка КАК Сырье,
		|	НоменклатураСырье.КАНАТ_НТДНоменклатуры КАК НТДСырья,
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Характеристика КАК ХарактеристикаСырья,
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Склад
		|	
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказаВыходныеИзделия
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураПродукция
		|			ПО ПроизводствоБезЗаказаВыходныеИзделия.Номенклатура = НоменклатураПродукция.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|			ПО ПроизводствоБезЗаказаВыходныеИзделия.Назначение = Назначения.Ссылка
		|		ПО (ПроизводствоБезЗаказа.Ссылка = ПроизводствоБезЗаказаВыходныеИзделия.Ссылка 
		|			И ПроизводствоБезЗаказаВыходныеИзделия.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.МатериалыИРаботы КАК ПроизводствоБезЗаказаМатериалыИРаботы
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСырье
		|			ПО ПроизводствоБезЗаказаМатериалыИРаботы.Номенклатура = НоменклатураСырье.Ссылка
		|		ПО ПроизводствоБезЗаказа.Ссылка = ПроизводствоБезЗаказаМатериалыИРаботы.Ссылка 
		|ГДЕ
		|	ПроизводствоБезЗаказа.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Заполнено = Ложь;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если НЕ Заполнено Тогда
				
				Заполнено = Истина;
				ЗаказНаПроизводство = ДанныеЗаполнения;
				Цех = Выборка.Цех;
				ДокументОснование = ДанныеЗаполнения;
				Продукция = Выборка.Продукция;
				НТДПродукции = Выборка.НТДПродукции;
				ЗаказКлиента = Выборка.ЗаказКлиента;
				Склад = Выборка.Склад;
				
				
			КонецЕсли;
			
			НоваяСтрока = Сырье.Добавить();
			НоваяСтрока.Сырье = Выборка.Сырье;
			НоваяСтрока.НТДСырья = Выборка.НТДСырья;
			НоваяСтрока.ХарактеристикаСырья = Выборка.ХарактеристикаСырья;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЭтапПроизводства2_2") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ЭтапПроизводства2_2.Подразделение КАК Цех,
		|	НоменклатураПродукция.Ссылка КАК Продукция,
		|	НоменклатураПродукция.КАНАТ_НТДНоменклатуры КАК НТДПродукции,
		|	ВЫБОР
		|	КОГДА ТИПЗНАЧЕНИЯ(ЭтапПроизводства2_2.Распоряжение.ДокументОснование) = ТИП(Документ.ЗаказКлиента) ТОГДА ЭтапПроизводства2_2.Распоряжение.ДокументОснование
		|	ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	КОНЕЦ КАК ЗаказКлиента,
		|	НоменклатураСырье.Ссылка КАК Сырье,
		|	НоменклатураСырье.КАНАТ_НТДНоменклатуры КАК НТДСырья,
		|	ЭтапПроизводства2_2РасходМатериаловИРабот.Характеристика КАК ХарактеристикаСырья,
		|	ЭтапПроизводства2_2.Распоряжение КАК ЗаказНаПроизводство,
		|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад КАК Склад
		|	
		|ИЗ
		|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураПродукция
		|			ПО ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = НоменклатураПродукция.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|			ПО ЭтапПроизводства2_2ВыходныеИзделия.Назначение = Назначения.Ссылка
		|		ПО (ЭтапПроизводства2_2.Ссылка = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка 
		|			И ЭтапПроизводства2_2ВыходныеИзделия.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.РасходМатериаловИРабот КАК ЭтапПроизводства2_2РасходМатериаловИРабот
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСырье
		|			ПО ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура = НоменклатураСырье.Ссылка
		|		ПО ЭтапПроизводства2_2.Ссылка = ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
		|		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = ЭтапПроизводства2_2.Ссылка
		|			И  ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НомерСтроки = 1)
		|ГДЕ
		|	ЭтапПроизводства2_2.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Заполнено = Ложь;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если НЕ Заполнено Тогда
				
				Заполнено = Истина;
				ЗаказНаПроизводство = Выборка.ЗаказНаПроизводство;
				ДокументОснование = ДанныеЗаполнения;
				Цех = Выборка.Цех;
				Продукция = Документы.ЭтапПроизводства2_2.ДанныеПартииПроизводства(ДанныеЗаполнения.Распоряжение,
																				   ДанныеЗаполнения.НазначениеПродукция, 
																				   ДанныеЗаполнения.ПартияПроизводства).ОсновноеИзделиеНоменклатура;
				НТДПродукции = Продукция.КАНАТ_НТДНоменклатуры;
				ЗаказКлиента = Выборка.ЗаказКлиента;
				Склад = Выборка.Склад;
				
				
			КонецЕсли;
			
			НоваяСтрока = Сырье.Добавить();
			НоваяСтрока.Сырье = Выборка.Сырье;
			НоваяСтрока.НТДСырья = Выборка.НТДСырья;
			НоваяСтрока.ХарактеристикаСырья = Выборка.ХарактеристикаСырья;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Продукция) Тогда
		
		ЗаполнитьРезультатИспытаний();
		ВидГотовойПродукцииИспытания = Продукция.КАНАТКач_ВидДляКонтроляКачества;
		
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьРезультатИспытаний()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураКАНАТ_ПоказателиНТД.Показатель КАК Показатель,
		|	НоменклатураКАНАТ_ПоказателиНТД.Размерность КАК ЕдИзм,
		|	НоменклатураКАНАТ_ПоказателиНТД.Значение КАК Норма,
		|	НоменклатураКАНАТ_ПоказателиНТД.Отклонение КАК ДопустимоеОтклонение,
		|	Истина КАК ВыводитьВПФ
		|ИЗ
		|	Справочник.Номенклатура.КАНАТ_ПоказателиНТД КАК НоменклатураКАНАТ_ПоказателиНТД
		|ГДЕ
		|	НоменклатураКАНАТ_ПоказателиНТД.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Продукция);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	РезультатИспытаний.Загрузить(РезультатЗапроса);
	
КонецПроцедуры
